[
  {
    "name": "Milk Booking Website",
    "image_url": "https://i.postimg.cc/V6j7NxY3/kp.jpg",
    "description": "A user-friendly web application for scheduling daily or weekly milk deliveries, allowing customers to place bookings and track orders while providing admins with simple tools to manage subscriptions and deliveries.",
    "website_url": "https://shivrajdairyfarm.web.app/"
  },
  {
    "name": "Basic Hotel Order Management",
    "image_url": "https://i.postimg.cc/V6j7NxY3/kp.jpg",
    "description": "A lightweight restaurant order management system that enables customers to browse menus, place orders, and track status, while providing admins with an easy dashboard to manage orders efficiently.",
    "website_url": "https://creativeledgertesting014.web.app/"
  },
  {
    "name": "Basic Ecom",
    "image_url": "https://i.postimg.cc/V6j7NxY3/kp.jpg",
    "description": "A simple yet functional e-commerce website featuring product listings, add-to-cart functionality, and a streamlined checkout process — built to demonstrate core web development and responsive design skills.",
    "website_url": "https://rajconcretes.com/"
  },
  {
    "name": "Background Remover",
    "image_url": "https://i.postimg.cc/V6j7NxY3/kp.jpg",
    "description": "An AI-powered demo website that allows users to upload images and instantly remove or replace backgrounds with a clean, intuitive interface — built to highlight image processing and user-friendly design skills.",
    "website_url": "https://bgcleaned.web.app/"
  },
  {
    "name": "Hotel Website",
    "image_url": "https://i.postimg.cc/V6j7NxY3/kp.jpg",
    "description": "A professional hotel demo website highlighting elegant rooms, premium amenities, and a seamless booking experience — built to demonstrate responsive design and clean aesthetics.",
    "website_url": "https://alfuvilla.web.app/"
  },
  {
    "name": "Dummy E-Com Website",
    "image_url": "https://i.postimg.cc/V6j7NxY3/kp.jpg",
    "description": "A modern and user-friendly e-commerce platform where customers can explore a wide range of dummy products, add items to their cart, and experience seamless checkout — built purely for demo and testing purposes.",
    "website_url": "https://dummyecom.web.app/"
  },
  {
    "name": "KUTEEPIES – Interactive Learning Platform",
    "image_url": "https://i.postimg.cc/V6j7NxY3/kp.jpg",
    "description": "A responsive and user-friendly educational platform offering a range of skill-based courses, including Photoshop, Animation, Graphic Design, and Music Production. Designed with accessibility in mind, it features intuitive navigation, interactive lessons, and a clean layout to enhance the learning experience across all devices.",
    "website_url": "https://kuteepiestesting.web.app/"
  },
  {
    "name": "LoanPulse Notify – Due Date Reminder System",
    "image_url": "https://i.postimg.cc/fLGj31SV/image.png",
    "description": "LoanPulse Notify – Due Date Reminder System is a software solution designed to manage loan repayments. It connects with Database to track due dates and sends email reminders to users, ensuring they never miss a repayment date. The system includes a scheduling mechanism, secure authentication with service account credentials, and real-time logging for reliability.",
    "website_url": "https://duedate.onrender.com"
  },
  {
    "name": "Sportify Prime FC – Live Sports Event Platform",
    "image_url": "https://i.postimg.cc/c6qw8HXh/sfc.jpg",
    "description": "A fully responsive and interactive web application built for streaming live sports events. It features a custom-built video player with advanced controls including play/pause, seek, fullscreen, volume, and responsive scaling—offering a seamless viewing experience. The platform combines intuitive navigation with real-time content updates to ensure smooth performance across all devices.",
    "website_url": "https://sportifyprimefc.web.app/"
  },
  {
    "name": "Decent Coaching Classes – Educational Website",
    "image_url": "https://i.postimg.cc/d1szdtqB/dcc.jpg",
    "description": "An elegant and responsive website built for a coaching institute, featuring a clean UI, intuitive structure, and a professional design focused on accessibility and user experience.",
    "website_url": "https://decentcoachingclasses.web.app/"
  },
  {
    "name": "CourtConnect – Legal Case Search Platform",
    "image_url": "https://i.postimg.cc/wM3ZffRR/searchengine.jpg",
    "description": "A dynamic and responsive web app for streamlined legal case research. It features advanced exact and partial match search, category-based filters, and a modern dark-themed UI—powered by a structured case law database, secured by Google for reliable access and data protection.",
    "website_url": "https://courtconnect.onrender.com/"
  },
  {
    "name": "CourtConnect – Admin & Intern Case Submission Portal",
    "image_url": "https://i.postimg.cc/yNXMkSzx/dbmgmt.jpg",
    "description": "A secure and role-based case law management system designed for collaborative data entry and verification. Interns can log in and submit case details through a structured form, while admins access a dedicated dashboard to review, edit, and approve submissions before they are added to the main database. Features include separate login panels for interns and admins, real-time data handling, and a clean, responsive interface—secured by Google for safe access and authentication.",
    "website_url": "https://courtconnectdb.onrender.com/"
  },
  {
    "name": "Decent CBSE – Educational Website",
    "image_url": "https://i.postimg.cc/Bv0WSBkR/cbse.jpg",
    "description": "A professionally designed website for a CBSE school, combining a clean layout, responsive design, and user-centric navigation to effectively showcase institutional information and updates.",
    "website_url": "https://decentcbse.web.app/"
  },
  {
    "name": "Linking Website",
    "image_url": "https://i.postimg.cc/3RtzZ5NH/hs.jpg",
    "description": "A responsive and dynamic website designed to deliver a smooth user experience, featuring shortcut navigation for quick access to key links. The clean, modern layout ensures easy exploration of content, with seamless transitions and intuitive navigation optimized for all devices.",
    "website_url": "https://hasanskyscreen.web.app/"
  }
]
